<template>
  <div>
    <h2>你好</h2>
    <div
      class="scoll_wrap"
      @scroll="box"
      @mousedown="boxdown"
      @mouseup="boxdoup"
    >
      <div class="scoll_box">
        <li class="user" v-for="(item, index) in mastlist" :key="index">
          {{ item.name }}
        </li>
      </div>
      <div></div>
    </div>
  </div>
</template>
<script>
import "vue-virtual-scroller/dist/vue-virtual-scroller.css";
import { addlist } from "../../http/api";
export default {
  data() {
    return {
      list: [
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
        {
          name: "这是一段文字",
        },
      ],
      mastlist: [],
    };
  },
  created() {
    this.addlist();
  },
  methods: {
    async addlist() {
      const res = await addlist();
      console.log(res);
      if (res.status == 200) {
        this.mastlist = res.data.array;
      }
    },
    box(e) {
      //   console.log(e.target.scrollTop)
      //   console.log(e.target.scrollHeight)
    },

    boxdown(e) {
      console.log(e, "222222222");
    },
    boxdoup(e) {
      console.log(e, "pppppppp");
    },
  },
};
</script>
<style lang="scss" scoped>
.scoll_wrap {
  width: 100%;
  height: 500px;
  position: relative;
  overflow-y: scroll;
  .scoll_box {
    width: 100%;
    background: red;
    position: absolute;
    left: 0;
    top: 0;
    li {
      width: 100%;
      height: 50px;
      border-bottom: 1px solid yellow;
      list-style: none;
    }
  }
}
</style>